class FitchItem {
  final int id;
  final String fitchName;
  final String fitchCode;
  final String fitchContext;

  FitchItem(this.id, this.fitchName, this.fitchCode, this.fitchContext);
}

// sample data
List<FitchItem> fitchItemList = [
  FitchItem(1, '1옥타브 도', 'C3', '평범한 여성, 남성 모두 쉽게 내려가는 음역대 입니다.'),
  FitchItem(3, '1옥타브 레', 'D3', '미성의 남성분이 아니라면 쉽게 내려가는 구간입니다.'),
  FitchItem(5, '1옥타브 미', 'E3', '이 구간에서 부드러운 소리가 나오면 당신은 중저음 킬러!?'),
  FitchItem(7, '1옥타브 파', 'F3', '매력적인 목소리를 가졌다면 당신의 별명은 성시경이겠군요 ㅎㅎ'),
  FitchItem(9, '1옥타브 솔', 'G3', '박완규씨가 부활 활동당시 이 구간까지 소리가 내려가지 않았다네요'),
  FitchItem(11, '1옥타브 라', 'A3', '남성분들 중에 이 구간이 안내려가는 사람 찾습니다!!'),
  FitchItem(13, '1옥타브 시', 'B3', '여성 기준으로 봐도 이 구간이 안내려간다면 당신은 저음불가..'),
  FitchItem(15, '2옥타브 도', 'C4', '남성분들도 이구간은 쉽죠?'),
  FitchItem(17, '2옥타브 레', 'D4', '아직 남성 평균 음역대는 아닙니다 갈길이 머네요 ㅎㅎ'),
  FitchItem(19, '2옥타브 미', 'E4', '목에 살짝 힘들어 갑니다 ~'),
  FitchItem(21, '2옥타브 파', 'F4', '내 지르세요!!'),
  FitchItem(23, '2옥타브 솔', 'G4', '여기부터가 남성 평균 음역대 입니다 :)'),
  FitchItem(25, '2옥타브 라', 'A4', '슬슬 남성분들은 탈락하는 구간입니다'),
  FitchItem(27, '2옥타브 시', 'B4', '여기서부턴 여성분들도 슬슬 힘들어지는 구간입니다'),
  FitchItem(29, '3옥타브 도', 'C5', '남자들의 로망이자 꿈, 3옥타브입니다!'),
  FitchItem(31, '3옥타브 레', 'D5', '여성분들도 힘들어지기 시작!'),
  FitchItem(33, '3옥타브 미', 'E5', '여성분들도 대거탈락 하는 구간!?'),
  FitchItem(35, '3옥타브 파', 'F5', '이 구간 되는 사람 찾습니다..'),
  FitchItem(37, '3옥타브 솔', 'G5', '여기 까지 올라간다구?? 당신은 혹시 돌고래?'),
  FitchItem(39, '3옥타브 라', 'A5', '가수 해 볼 생각 없나요?'),
  FitchItem(41, '3옥타브 시', 'B5', '소리를 지르고 있지는 않은지 확인해보세요!'),
  FitchItem(43, '4옥타브 도', 'C6', '4옥타브 부터 당신은 탈일반인!'),
  FitchItem(45, '4옥타브 레', 'D6', '남자 가수들의 노래에 아주 가끔 등장하는 음역대 입니다.'),
  FitchItem(47, '4옥타브 미', 'E6', '전설적인 록 보컬 프레디 머큐리의 녹음된 음성기준 최고 음역대 입니다!!'),
  FitchItem(49, '4옥타브 파', 'F6', '가수 박정현씨의 최고 음역대라고 하네요!'),
  FitchItem(
      51, '4옥타브 솔', 'G6', '성별에 관계없이 이 음역대가 진성으로 가능하다면 당신은 세계적인 가수가 될 수 있어요!'),
  FitchItem(53, '4옥타브 라', 'A6', '나는 낭만고양이 ~ 체리필터 조유진씨가 애드립을 할 때 기준 최고음!!'),
  FitchItem(55, '4옥타브 시', 'B6', '이 구간이 가능한 당신은 진정한 고음킬러입니다!!!'),
];
